{
	"Namespace":"mod",
	"File":"ExampleMod.java",
	"equire":[],
	"Version":"1.7.10",
	"SubItemList":["item","block"],
	"VarList":{
		"minecraftversion":{
			"type":"string",
			"default":"",
			"necessary":"false",
			"comment":
			[			       
			    "The acceptable range of minecraft versions that this mod will load and run in The default ",
				"(\"empty string\") indicates that only the current minecraft version is acceptable. FML will refuse ",
				"to run with an error if the minecraft version is not in this range across all mods."
			]
		},
		"remoteversion":{
			"type":"string",
			"default":"",
			"necessary":"false",
			"comment":
			[
			    "A replacement for the no-longer-existing \"versionRange\" of NetworkMod. Specify a ",
				"remote version range that this mod will accept as valid. Defaults to nothing, which is ",
				"interpreted as \"only this version\". Another special value is '*' which means accept all ",
				"versions. This is ignored if there is a NetworkCheckHandler annotation on a method in this",
				"class.\n ",
				"Returns:A version range as specified by the maven version range specification or the empty string"
			]
		},
		"saveversion":{
			"type":"string",
			"default":"",
			"necessary":"false",
			"comment":[
				"A version range specifying compatible save version information. If your mod follows good",
				"version numbering practice Like this (http://semver.org/) then this should be sufficient.",
				"Advanced users can specify a SaveInspectionHandler instead.\n",
				"Returns:A version range as specified by the maven version range specification or the empty string"
			]
		},
		"canbedeactived":{
			"type":"bool",
			"default":"false",
			"necessary":"false",
			"comment":
			[
				"If your mod doesn't have a runtime persistent effect on the state of the game, and can be ",
				"disabled without side effects (minimap mods, graphical tweak mods) then you can set true",
				"here and receive the FMLDeactivationEvent to perform deactivation tasks. This  does not affect ",
				"administrative disabling through the system property fml.modStates or the config file ",
				"fmlModState.properties. The mod will only be deactivated outside of a running game world",
				" - FML will never allow mod deactivation whilst a game server is running.\n",
				"Returns:if this mod can be deactivated whilst the game is open."
			]
		},
		"dependencies":{
			"type":"string",
			"default":"",
			"necessary":"false",
			"comment":
			[
			 	"A simple dependency string for this mod (see modloader's \"priorities\" string specification)"
			]
		},
		"modid":{
			"type":"string",
			"default":"examplemod",
			"necessary":"true",
			"comment":
			[
			 	"The unique mod identifier for this mod"
			]
		},
		"version":{
			"type":"string",
			"default":"1.0",
			"necessary":"true",
			"comment":
			[
			 	"A version string for this mod"
			]
		},
		"name":{
			"type":"string",
			"default":"ExampleMod",
			"necessary":"true",
			"comment":
			[
			 	"A user friendly name for the mod"
			]
		}
	},
	"GlobalList":{
	}
}